{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":4,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true,"batch_input_shape":[null,5],"dtype":"float32"}},{"class_name":"Dense","config":{"units":4,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true}},{"class_name":"Dense","config":{"units":4,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true}},{"class_name":"Dense","config":{"units":4,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true}},{"class_name":"Dense","config":{"units":6,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true}}],"keras_version":"tfjs-layers 0.6.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./my-model-1.weights.bin"],"weights":[{"name":"dense_Dense3/kernel","shape":[5,4],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense7/kernel","shape":[4,6],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[6],"dtype":"float32"}]}]}